---
kind: property
id: P:Autodesk.Revit.DB.ExportLineweightKey.OriginalLineweight
source: html/dee4e8f6-3e7a-1366-6bae-4f9c92b0b5c0.htm
---
# Autodesk.Revit.DB.ExportLineweightKey.OriginalLineweight Property

The original line weight.

## Syntax (C#)
```csharp
public int OriginalLineweight { get; set; }
```